2024-07-24-parallel-evm:-reth.html
<!doctype html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta
      name="description"
      content="This is a personal note for [[https://www.paradigm.xyz/2024/04/reth-perf][Reth-performance-blog]]"
    />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://chenyo-17.github.io/org-static-blog/rss.xml"
      title="RSS feed for https://chenyo-17.github.io/org-static-blog"
    />
    <title>parallel-evm: Reth</title>
    <meta name="author" content="chenyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link rel="stylesheet" href="static/style.css" type="text/css" />
  </head>
  <body>
    <div id="preamble" class="status">
      <header>
        <h1>
          <a href="https://chenyo-17.github.io/org-static-blog"
            >Chenyo's org-static-blog</a
          >
        </h1>
        <nav>
          <a href="https://chenyo-17.github.io/org-static-blog">Home</a>
          <a href="https://chenyo-17.github.io/org-static-blog/archive.html"
            >Archive</a
          >
          <a href="https://chenyo-17.github.io/org-static-blog/tags.html"
            >Tags</a
          >
        </nav>
      </header>
    </div>
    <div id="content">
      <div class="post-date">24 Jul 2024</div>
      <h1 class="post-title">
        <a
          href="https://chenyo-17.github.io/org-static-blog/2024-07-24-parallel-evm:-reth.html"
          >parallel-evm: Reth</a
        >
      </h1>
      <nav id="table-of-contents" role="doc-toc">
        <h2>Table of Contents</h2>
        <div id="text-table-of-contents" role="doc-toc">
          <ul>
            <li>
              <a href="#org1c21fde">1. Blockchain fundamentals</a>
              <ul>
                <li><a href="#org4ecdc2f">1.1. Ethereum engine API</a></li>
                <li><a href="#orgad56146">1.2. Foundry</a></li>
                <li><a href="#orgb8cec00">1.3. Revm</a></li>
                <li><a href="#org5703b19">1.4. Alloy</a></li>
                <li><a href="#org535107e">1.5. Erigon &amp; Staged sync</a></li>
                <li>
                  <a href="#org359c489">1.6. Storage engines</a>
                  <ul>
                    <li><a href="#org14003d7">1.6.1. ACID</a></li>
                    <li>
                      <a href="#orgb343a80"
                        >1.6.2. MVCC (Multi-version concurrency control)</a
                      >
                    </li>
                    <li>
                      <a href="#org980ab2f">1.6.3. Common database models</a>
                    </li>
                    <li>
                      <a href="#org68c2b61">1.6.4. Common storage engines</a>
                    </li>
                  </ul>
                </li>
                <li><a href="#orgbcfafeb">1.7. Reth</a></li>
              </ul>
            </li>
            <li>
              <a href="#org1d87960">2. Reth current status (April 2024)</a>
            </li>
          </ul>
        </div>
      </nav>
      <p>
        This is a personal note for
        <a href="https://www.paradigm.xyz/2024/04/reth-perf"
          >Reth-performance-blog</a
        >
        as well as some terminology explain online, e.g.,
        <a href="https://github.com/paradigmxyz/reth">Reth-repo</a> and
        <a href="https://claude.ai/chat/6364436f-d279-4c6b-947e-237bfea26409"
          >Claude.ai</a
        >.
      </p>
      <div id="outline-container-org1c21fde" class="outline-2">
        <h2 id="org1c21fde">
          <span class="section-number-2">1.</span> Blockchain fundamentals
        </h2>
        <div class="outline-text-2" id="text-1"></div>
        <div id="outline-container-org4ecdc2f" class="outline-3">
          <h3 id="org4ecdc2f">
            <span class="section-number-3">1.1.</span>
            <a
              href="https://github.com/ethereum/execution-apis/blob/a0d03086564ab1838b462befbc083f873dcf0c0f/src/engine/paris.md"
              >Ethereum engine API</a
            >
          </h3>
          <div class="outline-text-3" id="text-1-1">
            <ul class="org-ul">
              <li>
                A collection of JSON-RPC methods that all execution clients
                implement.
              </li>
              <li>
                Specify the interfaces between consensus and execution layers.
              </li>
            </ul>
          </div>
        </div>
        <div id="outline-container-orgad56146" class="outline-3">
          <h3 id="orgad56146">
            <span class="section-number-3">1.2.</span>
            <a href="https://github.com/foundry-rs/foundry/">Foundry</a>
          </h3>
          <div class="outline-text-3" id="text-1-2">
            <ul class="org-ul">
              <li>
                A Rust-written toolkit for Ethereum application development.
              </li>
              <li>
                Consists of an Ethereum testing framework Forge; a framework to
                interact with the chain Cast; a local Ethereum node Anvil; and a
                Solidity REPL (Read-Eval-Print-Loop: an interactive environment)
                Chisel.
              </li>
            </ul>
          </div>
        </div>
        <div id="outline-container-orgb8cec00" class="outline-3">
          <h3 id="orgb8cec00">
            <span class="section-number-3">1.3.</span>
            <a href="https://github.com/bluealloy/revm/">Revm</a>
          </h3>
          <div class="outline-text-3" id="text-1-3">
            <ul class="org-ul">
              <li>
                A Rust-written EVM; responsible for executing transactions and
                contracts.
              </li>
            </ul>
          </div>
        </div>
        <div id="outline-container-org5703b19" class="outline-3">
          <h3 id="org5703b19">
            <span class="section-number-3">1.4.</span>
            <a href="https://github.com/alloy-rs">Alloy</a>
          </h3>
          <div class="outline-text-3" id="text-1-4">
            <ul class="org-ul">
              <li>
                A library to interact with the Ethereum and other EVM-base
                chains.
              </li>
            </ul>
          </div>
        </div>
        <div id="outline-container-org535107e" class="outline-3">
          <h3 id="org535107e">
            <span class="section-number-3">1.5.</span>
            <a href="https://erigon.tech/">Erigon</a> &amp; Staged sync
          </h3>
          <div class="outline-text-3" id="text-1-5">
            <ul class="org-ul">
              <li>
                Erigon: a Go-written Ethereum client implementation (execution
                layer).
              </li>
              <li>
                Staged sync: break the chain synchronization process into
                distinct stages in order to achieve better efficiency.
              </li>
            </ul>
          </div>
        </div>
        <div id="outline-container-org359c489" class="outline-3">
          <h3 id="org359c489">
            <span class="section-number-3">1.6.</span> Storage engines
          </h3>
          <div class="outline-text-3" id="text-1-6"></div>
          <div id="outline-container-org14003d7" class="outline-4">
            <h4 id="org14003d7">
              <span class="section-number-4">1.6.1.</span> ACID
            </h4>
            <div class="outline-text-4" id="text-1-6-1">
              <ul class="org-ul">
                <li>
                  A set of properties for database transactions: atomicity,
                  consistency, isolation, duration.
                </li>
                <li>
                  Atomicity: a transaction is treated as an indivisible unit; if
                  any part of the transaction fails, the entire transaction is
                  rolled back.
                </li>
                <li>
                  Consistency: a transaction brings the database from one valid
                  state to another.
                </li>
                <li>
                  Isolation: concurrent transaction execution leave the database
                  in the same state as if transactions are executed sequentially
                </li>
                <li>
                  Duration: a committed transaction remains committed even when
                  the system fails.
                </li>
              </ul>
            </div>
          </div>
          <div id="outline-container-orgb343a80" class="outline-4">
            <h4 id="orgb343a80">
              <span class="section-number-4">1.6.2.</span> MVCC (Multi-version
              concurrency control)
            </h4>
            <div class="outline-text-4" id="text-1-6-2">
              <ul class="org-ul">
                <li>A concurrency control model used in DBMS.</li>
                <li>
                  MVCC keeps multiple version of data simultaneously, each
                  transaction sees a snapshot of the database.
                </li>
              </ul>
            </div>
          </div>
          <div id="outline-container-org980ab2f" class="outline-4">
            <h4 id="org980ab2f">
              <span class="section-number-4">1.6.3.</span> Common database
              models
            </h4>
            <div class="outline-text-4" id="text-1-6-3">
              <ul class="org-ul">
                <li>Relational model, e.g., SQL.</li>
                <li>Document model.</li>
                <li>Network model.</li>
                <li>key-value, e.g., NoSQL.</li>
              </ul>
            </div>
          </div>
          <div id="outline-container-org68c2b61" class="outline-4">
            <h4 id="org68c2b61">
              <span class="section-number-4">1.6.4.</span> Common storage
              engines
            </h4>
            <div class="outline-text-4" id="text-1-6-4">
              <ul class="org-ul">
                <li>
                  MDBX: Ultra-fate key-value embedded database with ACID and
                  MVCC supported.
                </li>
                <li>
                  LevelDB: Google-developed key-value store using log-structured
                  merge-tree for high write throughput.
                </li>
                <li>
                  RocksDB: Meta&rsquo;s fork of LevelDB, optimized for fast
                  storage.
                </li>
                <li>
                  LSM-based DBs, e.g., BadgerDB: optimized for write-heavy
                  workloads with log-structured merge-tree.
                </li>
                <li>
                  BoltDB: Go-written key-value database with optimized B+ tree,
                  ACID supported.
                </li>
                <li>
                  LMDB: memory-mapped key-value store with ACID and MVCC
                  supported.
                </li>
              </ul>
            </div>
          </div>
        </div>
        <div id="outline-container-orgbcfafeb" class="outline-3">
          <h3 id="orgbcfafeb">
            <span class="section-number-3">1.7.</span> Reth
          </h3>
          <div class="outline-text-3" id="text-1-7">
            <ul class="org-ul">
              <li>
                A Rust implementation of an Ethereum full node; allows users to
                interact with the Ethereum blockchain.
              </li>
              <li>
                An execution layer that implements all Ethereum engine APIs.
              </li>
              <li>Modularity: every component is built as a library.</li>
              <li>
                Performance: uses Erigon staged-sync node architecture and other
                Rust libraries (e.g., Alloy, revm); tests and optimizes on
                Foundry.
              </li>
              <li>Database/Storage engine: MDBX.</li>
            </ul>
          </div>
        </div>
      </div>
      <div id="outline-container-org1d87960" class="outline-2">
        <h2 id="org1d87960">
          <span class="section-number-2">2.</span> Reth current status (April
          2024)
        </h2>
      </div>
      <div class="taglist">
        <a href="https://chenyo-17.github.io/org-static-blog/tags.html">Tags</a
        >:
        <a href="https://chenyo-17.github.io/org-static-blog/tag-evm.html"
          >evm</a
        >
        <a
          href="https://chenyo-17.github.io/org-static-blog/tag-paralle-evm.html"
          >paralle-evm</a
        >
        <a href="https://chenyo-17.github.io/org-static-blog/tag-reth.html"
          >reth</a
        >
      </div>
    </div>
    <div id="postamble" class="status">
      <footer>
        <p>© 2024 chenyo. Some rights reserved.</p>
      </footer>
    </div>
  </body>
</html>
